Update1C/ВыгрузкаФайловКонфигурации/Catalogs/КаталогиЗагрузки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Catalog>
		<Properties>
			<Name>КаталогиЗагрузки</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Адрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Порт</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяПользователя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Настроен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пароль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипКаталога</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКаталогов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПараметрыПодключения</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеРаботает</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Update1C/ВыгрузкаФайловКонфигурации/Enums/ТипыКаталогов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Enum>
		<Properties>
			<Name>ТипыКаталогов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВебХранилище</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Локальный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Удаленный</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Update1C/ВыгрузкаФайловКонфигурации/Catalogs/КаталогиЗагрузки/Ext/ManagerModule.bsl
Процедура ИнициализацияСправочника() Экспорт
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КаталогиЗагрузки.Ссылка КАК Ссылка,
	|	КаталогиЗагрузки.ИмяПредопределенныхДанных КАК ИмяПредопределенныхДанных
	|ИЗ
	|	Справочник.КаталогиЗагрузки КАК КаталогиЗагрузки
	|ГДЕ
	|	КаталогиЗагрузки.Предопределенный
	|	И НЕ КаталогиЗагрузки.Настроен";
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Для Каждого Каталог Из РезультатЗапроса Цикл
		
		СпрОбъект = Каталог.Ссылка.ПолучитьОбъект();
		
		Если СпрОбъект.ИмяПредопределенныхДанных = "Локальный" Тогда
			
			СпрОбъект.ТипКаталога = Перечисления.ТипыКаталогов.Локальный;
			
		Иначе
			СпрОбъект.ТипКаталога = Перечисления.ТипыКаталогов.ВебХранилище;
		КонецЕсли;		
			
		СпрОбъект.Настроен = Истина;
		
		СпрОбъект.ОбменДанными.Загрузка = Истина;
		
		СпрОбъект.Записать();
			
	КонецЦикла;
	
	ДропБокс_Объект = Справочники.КаталогиЗагрузки.ДропБокс.Ссылка.ПолучитьОбъект();
	
	ДропБокс_Объект.ОбменДанными.Загрузка = Истина;
	ДропБокс_Объект.НеРаботает = Истина;
	ДропБокс_Объект.Записать();
	
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	Если Данные.Ссылка.Предопределенный Тогда
		
		Если Данные.Ссылка.ИмяПредопределенныхДанных = "Локальный" Тогда
			
			Представление = Данные.Наименование + ": " + Данные.Ссылка.Адрес;
			
		ИначеЕсли Данные.Ссылка.ИмяПредопределенныхДанных = "ГуглДиск"
			Или Данные.Ссылка.ИмяПредопределенныхДанных = "ЯндексДиск" Тогда
			
			Представление = Данные.Наименование + ": " + Данные.Ссылка.ИмяПользователя;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры
